[{"id":60,"date":"2018-12-26T11:59:53","date_gmt":"2018-12-26T10:59:53","guid":{"rendered":"http:\/\/aceseeds.dwebs.dev\/aviso-legal\/"},"modified":"2024-01-24T12:27:41","modified_gmt":"2024-01-24T11:27:41","slug":"aviso-legal","status":"publish","type":"post","link":"https:\/\/www.aceseeds.org\/aviso-legal\/","title":{"rendered":"Aviso Legal"},"content":{"rendered":"<p>La presente Pol&iacute;tica de Privacidad,&nbsp;<span>de conformidad con el Reglamento General de Protecci&oacute;n de Datos 2016\/679 (&ldquo;RGPD&rdquo;)<\/span>&nbsp;establece los t&eacute;rminos en que&nbsp;usa y protege la informaci&oacute;n que es proporcionada por los usuarios en el momento de utilizar nuestra web.<\/p>\n<p>El RGPD establece normas relacionadas con la protecci&oacute;n de las personas f&iacute;sicas en relaci&oacute;n con el tratamiento de los datos personales y las normas relacionadas con la libre circulaci&oacute;n de datos personales. Protege los derechos y las libertades fundamentales de las personas f&iacute;sicas y, en particular, su derecho a la protecci&oacute;n de los datos personales.<\/p>\n<p>tus datos personales se recopilan, tratan y transfieren solo en la medida compatible con estos fines y esta pol&iacute;tica de privacidad; basada en los principios de legalidad y transparencia.<\/p>\n<p>En Ace Seeds estamos comprometidos con la seguridad de los datos de nuestros clientes y usuarios. Cuando en nuestros formularios te pedimos llenar los campos de informaci&oacute;n personal con la cual usted pueda ser identificado, generalmente tu&nbsp;<span>nombre, tu direcci&oacute;n de correo y la compa&ntilde;&iacute;a a la que representas<\/span>, lo hacemos asegurando que s&oacute;lo se emplear&aacute; de acuerdo con los t&eacute;rminos de esta pol&iacute;tica de privacidad.<\/p>\n<p>De acuerdo al nuevo reglamento de privacidad en cualquier momento puedes ejercer los siguientes derechos con respecto a los datos que nos has proporcionado.<\/p>\n<ul>\n<li><span>Derecho de acceso<\/span><\/li>\n<li><span>Derecho de rectificaci&oacute;n<\/span><\/li>\n<li><span>Derecho de oposici&oacute;n<\/span><\/li>\n<li><span>Derecho de supresi&oacute;n (&ldquo;al olvido&rdquo;)<\/span><\/li>\n<li><span>Derecho a la limitaci&oacute;n del tratamiento<\/span><\/li>\n<li><span>Derecho a la portabilidad<\/span><\/li>\n<li><span>Derecho a no ser objeto de decisiones individualizadas<\/span><\/li>\n<li><span>Derecho de informaci&oacute;n<\/span><\/li>\n<\/ul>\n<p>Toda la informaci&oacute;n pormenorizada la puedes encontrar en&nbsp;<a href=\"https:\/\/www.aepd.es\/reglamento\/derechos\/index.html\" rel=\"nofollow noopener\" target=\"_blank\">esta fuente<\/a>. Donde puedes descargar los documentos que te permiten ejercer tus derechos frente a nuestro representante de los datos.<\/p>\n<h4><span><br \/>Responsable de datos de Ace Seeds.<\/span><\/h4>\n<p>Para ejercer cualquiera de estos derechos solo tienes que escribirnos a esta direcci&oacute;n, que corresponde a la persona responsable del tratamiento de datos de Ace Seeds : &nbsp;<span><a href=\"mailto:info@aceseeds.org\">info@<\/a>aceseeds.org <\/span>&nbsp;y cualquier solicitud será atendida dentro de los 30 días.<\/p>\n<h4><span><br \/>Uso de la informaci&oacute;n recogida<\/span><\/h4>\n<p>Nuestra web emplea la informaci&oacute;n con el fin de proporcionar el mejor servicio posible a nuestros clientes, las personas interesadas en nuestros contenidos, y las personas que respondan a nuestras ofertas de empleo.<\/p>\n<p>Es posible que sean enviados correos electr&oacute;nicos peri&oacute;dicamente a trav&eacute;s de nuestro sitio con informaci&oacute;n relevante que puede ser de inter&eacute;s para nuestros subscriptores, ofertas especiales, nuevos servicios y otra informaci&oacute;n publicitaria que consideremos relevante, estos correos electr&oacute;nicos ser&aacute;n enviados a la direcci&oacute;n que usted proporcione y podr&aacute;n ser cancelados en cualquier momento.<\/p>\n<p>En Ace Seeds estamos comprometidos con el compromiso de mantener su informaci&oacute;n segura. Usamos los servidores mas seguros y el software m&aacute;s avanzados y los actualizamos constantemente para asegurarnos que no exista ning&uacute;n acceso no autorizado.<\/p>\n<h4><span><br \/>Enlaces a Terceros<\/span><\/h4>\n<p>Este sitio web contiene enlaces a otros sitios que pudieran ser de su inter&eacute;s. Una vez que usted de clic en estos enlaces y abandone nuestra p&aacute;gina, ya no tenemos control sobre el sitio al que es redirigido y por lo tanto no somos responsables de los t&eacute;rminos o privacidad ni de la protecci&oacute;n de sus datos en esos otros sitios terceros.<\/p>\n<p>Dichos sitios est&aacute;n sujetos a sus propias pol&iacute;ticas de privacidad por lo cual es recomendable que los consulte para confirmar que usted est&aacute; de acuerdo con estas.<\/p>\n<h4><span><br \/>Control de su informaci&oacute;n personal<\/span><\/h4>\n<p>En cualquier momento usted puede restringir la recopilaci&oacute;n o el uso de la informaci&oacute;n personal que es proporcionada a nuestros sitios web y APPs.&nbsp;Cada vez que se le solicite rellenar un formulario, como el de alta de usuario, puede marcar o desmarcar la opci&oacute;n de recibir informaci&oacute;n por correo electr&oacute;nico. En caso de que haya marcado la opci&oacute;n de recibir nuestro bolet&iacute;n o publicidad usted puede cancelarla en cualquier momento.<\/p>\n<p>Si tiene cualquier consulta o quiere dirigirse a nosotros por cualquier tema acerca del control de su informaci&oacute;n personal, puede escribirnos a:<\/p>\n<p>info@aceseeds.org , cualquier solicitud será atendida dentro de los 30 días.<\/p>\n<p>Representante del tratamiento de los datos de:<\/p>\n<p>Ace Web Progress SL<br \/>Nueve de Octubre 16B<br \/>46111, Rocafort (Valencia)&nbsp; <br \/>España<\/p>\n<p>En Ace Seeds nunca venderemos, cederemos ni distribuiremos la informaci&oacute;n personal que es recopilada sin su consentimiento, salvo que sea requerido por un juez con un orden judicial, o que sea imprescindible para prestarles el servicio requerido por contrato, en ese caso siempre informando y solicitando el permiso expreso.<\/p>\n<h4><span><br \/>Cookies<\/span><\/h4>\n<p>Una cookie se refiere a un fichero que es enviado con la finalidad de solicitar permiso para almacenarse en su ordenador\/terminal, al aceptar dicho fichero se crea y la cookie sirve entonces para tener informaci&oacute;n respecto al tr&aacute;fico web, y tambi&eacute;n facilita las futuras visitas a una web recurrente. Otra funci&oacute;n que tienen las cookies es que con ellas las web pueden reconocerte individualmente y por tanto brindarte el mejor servicio personalizado de su web.<\/p>\n<p>Nuestra web emplea las cookies para poder identificar las p&aacute;ginas que son visitadas y su frecuencia. Esta informaci&oacute;n es empleada &uacute;nicamente para an&aacute;lisis estad&iacute;stico y despu&eacute;s la informaci&oacute;n se elimina de forma permanente. Usted puede eliminar las cookies en cualquier momento desde su ordenador. Sin embargo las cookies ayudan a proporcionar un mejor servicio de los sitios web, est&aacute;s no dan acceso a informaci&oacute;n de su ordenador ni de usted, a menos de que usted as&iacute; lo quiera y la proporcione directamente. Usted puede aceptar o negar el uso de cookies, sin embargo la mayor&iacute;a de navegadores aceptan cookies autom&aacute;ticamente pues sirve para tener un mejor servicio web. Tambi&eacute;n usted puede cambiar la configuraci&oacute;n de su ordenador\/terminal para declinar las cookies. Si se declinan es posible que no pueda utilizar algunos de nuestros servicios.<\/p>\n<h4><span>Lugar de cumplimiento, jurisdicción y derecho aplicable<\/span><\/h4>\n<p>El lugar de cumplimiento para los servicios adeudados por ambas partes procedentes del pedido, así como la jurisdicción, es donde se encuentra la sede de aceseeds.org y se cumplen las obligaciones de la misma en Valencia, España. El derecho español, en particular el mercantil y el de protección de los consumidores y usuarios, será el único aplicable a todos los actos y negocios con aceseeds.org. Queda expresamente excluida la aplicación del Convenio de la ONU acerca de contratos sobre comercio internacional.<\/p>\n<p>&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;-<\/p>\n<p>La importaci&oacute;n, tenencia y venta de semillas de cannabis est&aacute; protegida de acuerdo con el Tratado Unilateral de Estupefacientes aprobado en Viena (1961). El cultivo de cannabis puede ser constitutivo de delito ( Art.25.1 de la Ley Org&aacute;nica de Protecci&oacute;n de la Seguridad Ciudadana y Art.368 del C&oacute;digo Penal).<\/p>\n<p>Nuestras semillas est&aacute;n de uso exclusivo para coleccionismo privado (souvenirs). Prohibida la venta a menores de 18 años.<\/p>\n<p>Prohibida su germinación, no son para uso agrícola.<\/p>\n<p>ACE Seeds no se hace responsable del uso ilegal que se puedan dar a sus semillas.<\/p>\n<p>ACE Seeds solo envia pedidos a aquellos lugares donde la legislaci&oacute;n permite la posesi&oacute;n de semillas de cannabis.<\/p>\n<p>ACE Seeds no se hace responsable de adonde env&iacute;en nuestros distribuidores y minoristas nuestro productos, puesto que son empresas independientes sin relaci&oacute;n legal con ACE Seeds.<\/p>\n<p>ACE WEB PROGRESS SL. es una empresa de distribuci&oacute;n de productos agr&iacute;colas, registrada en el Registro Mercantil con CIF: B98476583<\/p>\n","protected":false},"excerpt":{"rendered":"<p>La presente Pol&iacute;tica de Privacidad,&nbsp;de conformidad con el Reglamento General de Protecci&oacute;n de Datos 2016\/679 (&ldquo;RGPD&rdquo;)&nbsp;establece los t&eacute;rminos en que&nbsp;usa y protege la informaci&oacute;n que es proporcionada por los usuarios en el momento de utilizar nuestra web. El RGPD establece normas relacionadas con la protecci&oacute;n de las personas f&iacute;sicas en relaci&oacute;n con el tratamiento de [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[3],"tags":[],"class_list":["post-60","post","type-post","status-publish","format-standard","hentry","category-sin-categorizar"],"_links":{"self":[{"href":"https:\/\/www.aceseeds.org\/wp-json\/wp\/v2\/posts\/60","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.aceseeds.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.aceseeds.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.aceseeds.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.aceseeds.org\/wp-json\/wp\/v2\/comments?post=60"}],"version-history":[{"count":0,"href":"https:\/\/www.aceseeds.org\/wp-json\/wp\/v2\/posts\/60\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.aceseeds.org\/wp-json\/wp\/v2\/media?parent=60"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.aceseeds.org\/wp-json\/wp\/v2\/categories?post=60"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.aceseeds.org\/wp-json\/wp\/v2\/tags?post=60"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}]
