[{"id":890,"name":"ACE Seeds","slug":"ace-seeds-es","description":"ACE Seeds es un colectivo de criadores y amantes del cannabis, dedicados a la preservación y estudio de esta maravillosa planta.\r\n\r\nEn ACE Seeds queremos contribuir a mejorar la falta de diversidad genética y parar la depresión endogámica que sufren las variedades comerciales actualmente, ofreciendo innovadores híbridos criados a partir de nuestras propias líneas estabilizadas.\r\n\r\nEstamos orgullosos de presentaros las variedades de nuestro nuevo catálogo, procedentes de distintos criadores y coleccionistas privados. Estas genéticas son exclusivas y en algunos casos de stock limitado.","parent":888,"count":76,"image":{"id":23251,"src":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/aceseed.jpg","thumbnail":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/aceseed-300x288.jpg","srcset":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/aceseed.jpg 489w, https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/aceseed-300x177.jpg 300w","sizes":"(max-width: 489px) 100vw, 489px","name":"aceseed","alt":"aceseed"},"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/ace-seeds-es\/"},{"id":920,"name":"ACE Seeds R+D","slug":"aceseedsrd-es","description":"En la sección I+D puedes conocer y adquirir semillas de nuestros últimos proyectos de cría que aún están en desarrollo. Estas genéticas I+D no están tan evaluadas y documentadas como nuestros lanzamientos principales, aunque en el futuro pueden acabar formando parte del catálogo o ser comercializadas como futuras ediciones limitadas.","parent":888,"count":33,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/aceseedsrd-es\/"},{"id":902,"name":"Altas en CBD","slug":"altas-en-cbd","description":"En ACE Seeds somos conscientes del beneficioso potencial medicinal de las variedades ricas en CBD (cannabidiol). Prácticamente todas las variedades comerciales actuales de alto contenido en CBD se basan en la misma familia genética, por lo que en ACE Seeds creemos que era importante encontrar nuevas fuentes genéticas de CBD.\r\n\r\nFruto de nuestra investigación en este campo, ahora ofrecemos 2 familias ricas en CBD no relacionadas con el resto de variedades ricas en CBD del mercado: una sativa libanesa y la afgana ErdPurt, que ayudarán a mejorar la merma de diversidad genética que sufren actualmente las variedades ricas en CBD.","parent":858,"count":12,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/altas-en-cbd\/"},{"id":886,"name":"Autofloración","slug":"autofloracion","description":"Las variedades autoflorecientes empiezan a florecer a las 4 o 5 semanas desde su germinación, independientemente del fotoperiodo de interior o de la época del año en exterior, permitiéndoles madurar correctamente en latitudes muy alejadas del ecuador donde las variedades fotodependientes empiezan a florecer demasiado tarde para madurar a tiempo. \r\n\r\nLas genéticas autoflorecientes pueden ser cultivadas de forma que al germinarlas en primavera acaben madurando en verano, pudiéndose beneficiar en floración de los días más largos, con mayor intensad lumínica y temperaturas más cálidas, adelantándose así a la cosecha habitual de otoño de las variedades fotodependientes.","parent":858,"count":4,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/autofloracion\/"},{"id":856,"name":"Default Category","slug":"default-category-es","description":"","parent":0,"count":152,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/default-category-es\/"},{"id":882,"name":"Destacados","slug":"destacados","description":"Nuestra selección ACE Seeds de novedades, variedades más populares, rarezas más únicas, y genéticas que más nos gusta recomendar a nuestros clientes.  Una magnífica y equilibrada selección de variedades puras, increíbles super sativas, imponentes híbridos F1 sativa\/indica, líneas estabilizadas muy trabajadas, plantas de hachís indica de alta calidad y genéticas ricas en CBD. \r\n\r\nNo pierdas la oportunidad de disfrutar de esta extraordinaria colección de variedades de marihuana en formato de semillas regulares, semillas feminizadas y semillas autoflorecientes.","parent":856,"count":59,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/destacados\/"},{"id":872,"name":"Ediciones limitadas","slug":"ediciones-limitadas","description":"Nuestras ediciones limitadas son variedades de marihuana exclusivas en formato de semillas regulares y semillas feminizadas, desarrolladas recientemente fruto de nuestros últimos proyectos de cría, las cuales están disponibles por cortos periodos de tiempo y en cantidades muy limitadas. \r\n\r\nSi estás interesado\/a en alguna de estas ediciones limitadas te recomendamos adquirirlas tan pronto como sea posible, puesto que no podemos garantizar que estas semillas de cannabis exclusivas estén disponibles siempre, de hecho se agotan muy rápido!","parent":858,"count":16,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/ediciones-limitadas\/"},{"id":862,"name":"Feminizadas","slug":"feminizadas","description":"En esta sección web tienes a tu disposición la mejor selección de semillas de marihuana ACE Seeds feminizadas, compuesta por nuestras variedades de catálogo y ediciones limitadas.\r\n\r\nLas semillas feminizadas producen solo plantas hembras (en porcentajes superiores al 98%), y son las más indicadas para cultivos sinsemilla donde la prioridad es maximizar desde el inicio el número de plantas hembras, o para evitar problemas de polinizaciones indeseadas por parte de plantas macho.","parent":858,"count":54,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/feminizadas\/"},{"id":1422,"name":"Freebies","slug":"freebies-2","description":"","parent":0,"count":13,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/freebies-2\/"},{"id":910,"name":"Green Mountain Seeds","slug":"green-mountain-seeds-es","description":"Después de 42 años de cría con variedades puras y líneas estabilizadas únicas, surge Green Mountain Seeds con la idea de ofrecer al público semillas de variedades raras y espectaculares de sativa pura y sativa dominantes, que satisfagan las expectativas de los cultivadores de sativas más exigentes, en busca de líneas sativa uniformes, elegantes y con muchos rasgos deseables.","parent":888,"count":4,"image":{"id":23253,"src":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/geenmountain.png","thumbnail":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/geenmountain.png","srcset":"","sizes":"(max-width: 135px) 100vw, 135px","name":"geenmountain","alt":"geenmountain"},"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/green-mountain-seeds-es\/"},{"id":908,"name":"Híbridos Haze","slug":"hibridos-haze","description":"La Haze es la sativa más importante de la historia reciente de la cría de marihuana, y que sin embargo ha sido cruzada con variedades indica de forma indiscriminada por la mayoría de bancos en las últimas 3 décadas hasta desaparecer en su forma original de sativa pura extrema tropical, perdiendo esa psicoactividad sativa que la hicieron mundialmente famosa. \r\n\r\nEs por ello que en ACE Seeds, tras recibir en 2004 unas semillas de Haze puras, trabajamos durante años para poder rescatarla en toda su esencia original, variedad que llamamos Oldtimer’s Haze (en honor al criador británico que nos la donó), reconocida en todo el mundo como una de las pocas líneas Haze puras de calidad existentes actualmente, pudiéndose encontrar fenotipos de Green Haze y de la casi extinta Purple Haze. Con Oldtimer’s Haze hemos realizado excelentes híbridos Haze de fuerte influencia sativa, tales como Haze x Kali China, Panama Haze y Purple Haze x Malawi (entre otros).\r\n\r\nNuestros proyectos Haze se han expandido recientemente al poder acceder a los míticos clones élite de Haze que Nevil Schoenmakers seleccionó a finales de los 80, y que fueron los parentales utilizados para criar los mejores híbridos Haze de la historia en los años 80\/90, y que estamos incluyendo en nuestros últimos proyectos de cría, como en las nuevos super híbridos sativa Killer A5 Haze, Panama A5 Haze, Thai A5 Haze, Super Malawi Haze y Super Panama Haze, fruto de nuestra colaboración con Yo Sammy, miembro del pequeño grupo de cultivadores del sur de Holanda que han preservado estos clones élite de híbridos Haze desde hace casi 3 décadas.","parent":858,"count":29,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/hibridos-haze\/"},{"id":904,"name":"I+D","slug":"i-d-es","description":"","parent":856,"count":1,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/i-d-es\/"},{"id":914,"name":"Indian Landrace Exchange","slug":"indian-landrace-exchange-es","description":"","parent":888,"count":17,"image":{"id":23255,"src":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/IndianLandraceExchange.png","thumbnail":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/IndianLandraceExchange.png","srcset":"","sizes":"(max-width: 135px) 100vw, 135px","name":"IndianLandraceExchange","alt":"IndianLandraceExchange"},"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/indian-landrace-exchange-es\/"},{"id":918,"name":"Khalifa Genetics","slug":"khalifa-genetics-es","description":"Khalifa Genetics es un pequeño grupo de apasionados criadores que comparten una visión común: crear variedades únicas a partir de la cría con antiguas variedades puras nativas y cepas raras.\r\n\r\nAquí no encontrarás semillas Sour, Cookie, Gelato o Gorilla. Lo que ofrece Khalifa Genetics es una excelente colección de líneas estabilizadas y verdaderos híbridos F1, así como míticas variedades nativas de Oriente. Cada F1 o línea estabilizada que Khalifa Genetics tiene en su catálogo es el fruto de muchos años de duro trabajo. Son el resultado del cruce entre variedades locales o variedades raras que se seleccionaron y estabilizaron cuidadosamente durante muchas generaciones. Puesto que tu satisfacción es lo más importante, Khalifa Genetics nunca pondrían a tu disposición sus variedades a menos que hayan sido probadas exhaustivamente, y solo ofrecen variedades que consideran absolutamente excepcionales.\r\n\r\nTambién ofrecen variedades puras puesto que conforman nuestro patrimonio genético, y pueden ser muy interesantes para los criadores y coleccionistas que busquen perfiles de terpenos raros y efectos únicos. Todas las variedades autóctonas que Khalifa Genetics ofrecen son el resultado de una polinización abierta controlada realizada en interior, con el fin de reducir en gran medida la cantidad de hermafroditas, mutantes y plantas débiles, al tiempo que se preserva la mayor parte de la diversidad genética. Su producción de semillas es 100% orgánica. El cultivo orgánico hace que las plantas crezcan fuertes y produzcan semillas más saludables. Las semillas son almacenanadas en una instalación dedicada, renovando su stock de semillas cada año.","parent":888,"count":13,"image":{"id":23257,"src":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/KhalifaGenetics.png","thumbnail":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/KhalifaGenetics.png","srcset":"","sizes":"(max-width: 135px) 100vw, 135px","name":"KhalifaGenetics","alt":"KhalifaGenetics"},"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/khalifa-genetics-es\/"},{"id":888,"name":"Marcas","slug":"marcas-es","description":"<div class=\"grid12-6\">\r\n<p>Además de todas las variedades ACE Seeds que actualmente están disponibles en nuestra web, también os ofrecemos una selección de excelentes semillas de otros bancos de semillas, con los cuales compartimos una filosofía de trabajo similar de preservación y cría con variedades puras.\r\n<\/p>\t\t\r\n<p>Os ofrecemos semillas de marihuana de 2 bancos de semillas norteamericanos de calidad y reputación comprobadas, como Super Natural Selections, donde el criador Bodhi Seeds nos ofrece sus mejores híbridos de sativas americanas cruzadas con una vieja afgana pura, en variedades tales como Cherry Queen, DreadBread o Soar.\r\n<\/p>\r\n<\/div>\r\n\r\n<div class=\"grid12-6\">\r\n\r\n<p>También ofrecemos en exlusiva las variedades del nuevo banco Green Mountain Seeds, donde el criador Vermontman nos ofrece la esperada Purple Satellite, un híbrido 100 % sativa entra una sativa oaxaqueña y una nepalí, de muy rápida floración, bellísimos colores y gran calidad, y PineApple Banana Bud, otro híbrido 100 % sativa con exóticas genéticas hawaianas y de Malawi.\r\n<\/p>\r\n\r\n<\/div>","parent":856,"count":152,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/marcas-es\/"},{"id":874,"name":"Novedades","slug":"novedades","description":"En esta sección puedes encontrar los últimos lanzamientos ACE Seeds y de la selección de bancos de nuestra web: nuevas variedades puras, excepcionales variedades super sativa, híbridos sativa\/indica, plantas de hachís indica y nuevas variedades ricas en CBD. Esperamos que las disfrutéis esta temporada!","parent":856,"count":30,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/novedades\/"},{"id":866,"name":"Novedades","slug":"novedades-es","description":"","parent":858,"count":30,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/novedades-es\/"},{"id":868,"name":"Ofertas","slug":"ofertas-es","description":"¡Estate atento a nuestras promociones (a través de nuestro boletín de noticias) que encontrarás en esta sección en ciertas épocas del año!\r\n\r\nTambién encontrarás aquí nuestros ACE Mix (para cultivo interior y exterior en latitudes no tropicales) y Tropical Mix (para exterior en climas tropicales). Genéticas de fácil cultivo a precios muy asequibles.","parent":858,"count":15,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/ofertas-es\/"},{"id":876,"name":"Ofertas","slug":"ofertas","description":"","parent":856,"count":15,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/ofertas\/"},{"id":864,"name":"Puras \/ Estabilizadas","slug":"puras-estabilizadas","description":"La mejor selección de variedades puras e híbridos estabilizados. \r\nGenéticas únicas de todo el mundo procedentes de ACE Seeds y otros bancos.\r\n\r\nLas variedades puras son los pilares genéticos con las que se han desarrollado todas las variedades de marihuana modernas, y puesto que estas variedades puras están desapareciendo de sus lugares de origen (por diversos motivos) es una prioridad fundacional de ACE Seeds el preservar este legado genético para las futuras generaciones. \r\n\r\nTambién ofrecemos híbridos estabilizados muy trabajados y de gran calidad, que son estables y dominantes para muchos rasgos deseables.","parent":858,"count":61,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/puras-estabilizadas\/"},{"id":860,"name":"Regulares","slug":"standard","description":"En nuestra web tienes a tu disposición la mejor selección de semillas de marihuana regulares del mercado basadas en variedades puras, criadas por ACE Seeds y por otros bancos que también ofrecen semillas regulares de gran calidad.\r\n\r\nA diferencia de muchos otros bancos, que solo ofrecen semillas feminizadas, en ACE Seeds creemos firmemente que es de vital importancia continuar ofreciendo semillas regulares (que producen hembras y machos) de calidad.","parent":858,"count":99,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/standard\/"},{"id":912,"name":"Romulan Genetics","slug":"romulan-genetics-es","description":"Criadores de segunda generación trabajando principalmente a partir de variedades nativas. La crianza de Romulan Genetics se desarrolla con el objetivo de producir variedades que ofrezcan beneficios medicinales y que funcionen bien para aquellos usuarios con un alto nivel de tolerancia. Los trabajadores de Romulan Genetics son veteranos que crecieron en torno al cultivo y la cría de cannabis y se esfuerzan por crear variedades que hagan felices a las personas. ¡Comienza a cultivar semillas de Romulan Genetics desde hoy!","parent":888,"count":1,"image":{"id":23259,"src":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/romulangenetics.png","thumbnail":"https:\/\/www.aceseeds.org\/wp-content\/uploads\/2023\/11\/romulangenetics.png","srcset":"","sizes":"(max-width: 135px) 100vw, 135px","name":"romulangenetics","alt":"romulangenetics"},"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/romulan-genetics-es\/"},{"id":1437,"name":"Uncategorized","slug":"uncategorized-2","description":"","parent":0,"count":2,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/uncategorized-2\/"},{"id":858,"name":"Variedades","slug":"variedades","description":"<span style=\"font-family: Verdana, sans-serif\"><span style=\"font-size: large\">En ACE Seeds puedes encontrar las mejores sativas del mercado, así como una gran selección de variedades puras (sativa e indica), líneas estabilizadas\/endogámicas, e innovadores híbridos (de sativas puras, sativas dominantes, sativa\/indica e indica dominantes) desarrollados a partir de nuestros trabajos de preservación y cría. <\/span><\/span>\r\n\r\n<span style=\"font-family: Verdana, sans-serif\"><span style=\"font-size: large\">ACE seeds ofrece una gran variedad de semillas regulares, junto con una amplia selección de semillas feminizadas, sin olvidar las variedades autoflorecientes y variedades ricas en CBD. <\/span><\/span>\r\n\r\n<span style=\"font-family: Verdana, sans-serif\"><span style=\"font-size: large\">Somos pioneros en realizar y ofrecer análisis de cannabinoides, de terpenos y genéticos de muchas de nuestras variedades.<\/span><\/span>\r\n\r\n<span style=\"font-family: Verdana, sans-serif\"><span style=\"font-size: large\">Trabajamos sin descanso para mejorar y ampliar nuestro catálogo de variedades de marihuana, incluyendo nuevas variedades puras, nuevos híbridos y ediciones limitadas especiales. <\/span><\/span>\r\n\r\n<span style=\"font-family: Verdana, sans-serif\"><span style=\"font-size: large\">Además de todas las variedades desarrolladas por ACE Seeds, también ofrecemos exóticas variedades puras y variedades de semillas de marihuana criadas con variedades puras procedentes de otros bancos de contrastada calidad.<\/span><\/span>","parent":0,"count":153,"image":null,"review_count":0,"permalink":"https:\/\/www.aceseeds.org\/variedades\/"}]
