[{"id":1155,"date":"2017-04-14T18:45:37","date_gmt":"2017-04-14T17:45:37","guid":{"rendered":"http:\/\/drunderground.com\/politica-de-privacidad\/"},"modified":"2017-04-14T18:48:28","modified_gmt":"2017-04-14T17:48:28","slug":"politica-de-privacidad","status":"publish","type":"page","link":"https:\/\/drunderground.com\/politica-de-privacidad\/","title":{"rendered":"Política de Privacidad"},"content":{"rendered":"<p><strong>Información general sobre protección de los datos incorporados en nuestra Web por los usuarios<\/strong><br \/>\nEn esta web, propiedad de Alfredo Sánchez Alamo con DNI autónomo 78498957A ( Dr. Underground Feminized Seeds ) aseguramos la total protección de los datos de carácter personal proporcionados por nuestros usuarios. De conformidad con lo dispuesto en la <strong>Ley Orgánica 15\/1999, de 13 de diciembre, sobre Protección de Datos de Carácter Personal (LOPD) <\/strong>le informamos que los datos personales facilitados a través de esta web, desde formularios o mediante mensajes de correo electrónico, podrán ser incorporados en un fichero de datos de carácter personal, debidamente registrado en la Agencia Española de Protección de Datos. Una vez facilitados, el remitente da su consentimiento para que dichos datos sean incluido en los mencionados ficheros. Así mismo, desde esta web se podrán recoger direcciones IP de los usuarios, las cuáles serán igualmente tratadas de acuerdo a la normativa vigente.  Dr. Underground Feminized Seeds respetará en todo momento la confidencialidad de sus datos, según conformidad con la Ley Orgánica 15\/1999 (LOPD). En cualquier momento el usuario podrá ejercitar sus derechos de acceso, rectificación, cancelación y oposición en los términos especificados en la Ley Orgánica 15\/1999 (LOPD), conforme al procedimiento legalmente establecido. Estos derechos podrán ser ejercidos dirigiéndose por correo electrónico a info@DrUnderground.com<\/p>\n<p><strong>Formularios de contacto para recogida de datos para envío de Newsletter<\/strong><br \/>\nDe acuerdo con lo establecido por la Ley Orgánica 15\/1999, de 13 de diciembre, sobre Protección de Datos de Carácter Personal (LOPD) el solicitante o cliente minorista, al cumplimentar los formularios de recogida de datos, da su consentimiento para que dichos datos sean incluidos en un fichero del que es titular  y para que puedan ser utilizados con la finalidad de atender las consultas realizadas a través de formularios de contacto así como el envío de newsletters. En ningún caso los datos serán cedidos a terceros sin el consentimiento del solicitante o cliente, quien queda informado sobre los derechos de acceso, rectificación, cancelación y oposición a los mismos que puede ejercer enviando un correo electrónico a info@DrUnderground.com.<\/p>\n<p><strong>Formularios de recogida de datos en el proceso de compra<\/strong><br \/>\nDe acuerdo con lo establecido por la Ley Orgánica 15\/1999, de 13 de diciembre, sobre Protección de Datos de Carácter Personal (LOPD), el cliente minorista o solicitante, al cumplimentar los formularios de recogida de datos solicitados durante el proceso de compra, da su consentimiento para que dichos datos sean incluidos en un fichero del que es titular Dr. Underground Feminized Seeds y puedan ser utilizados con la finalidad de gestión administrativa, contable y fiscal, gestión de las relaciones comerciales y transacciones económicas, comercio electrónico, acciones de marketing y publicidad en general. Dichos datos podrán ser cedidos, siempre protegiéndolos adecuadamente, a: Administración Tributaria, bancos, cajas de ahorros y cajas rurales, y Administración Pública con competencia en la materia. El cliente minorista o solicitante queda informado sobre los derechos de acceso, rectificación, cancelación y oposición que puede ejercer enviando un correo electrónico a info@DrUnderground.com<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Información general sobre protección de los datos incorporados en nuestra Web por los usuarios En esta web, propiedad de Alfredo Sánchez Alamo con DNI autónomo 78498957A ( Dr. Underground Feminized Seeds ) aseguramos la total protección de los datos de carácter personal proporcionados por nuestros usuarios. De conformidad con lo dispuesto en la Ley Orgánica<\/p>\n","protected":false},"author":13,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/drunderground.com\/wp-json\/wp\/v2\/pages\/1155"}],"collection":[{"href":"https:\/\/drunderground.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/drunderground.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/drunderground.com\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/drunderground.com\/wp-json\/wp\/v2\/comments?post=1155"}],"version-history":[{"count":1,"href":"https:\/\/drunderground.com\/wp-json\/wp\/v2\/pages\/1155\/revisions"}],"predecessor-version":[{"id":1157,"href":"https:\/\/drunderground.com\/wp-json\/wp\/v2\/pages\/1155\/revisions\/1157"}],"wp:attachment":[{"href":"https:\/\/drunderground.com\/wp-json\/wp\/v2\/media?parent=1155"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}]
