[{"id":47,"name":"Auto-Flowering","slug":"auto-flowering","description":"<h4><b>Automatic seeds<\/b> are cannabis varieties with a Ruderalis crossing. They have been bred specifically to have the quality of automatic flowering, which means that these plants do not need to be put on a 12-hour light cycle in order to go into flowering. They will simply flower when they are ready. Producing fast and easy growing plants, these seeds are the perfect choice for the first time grower.<\/h4>","parent":48,"count":6,"image":null,"review_count":0,"permalink":"https:\/\/kcbrains.com\/product-category\/cannabis-seeds\/auto-flowering\/"},{"id":48,"name":"Cannabis Seeds","slug":"cannabis-seeds","description":"<h4><b>Welcome to the K.C. Brains Seed Shop!<\/b> Below you can select from all our Regular- Feminized, or Automatic Flowering Cannabis seeds.\r\nK.C. Brains Seeds come in packs of 5 seeds per pack. We solely send seeds in their original packaging. (not as single seeds). For wholesale prices, please contact us.<\/h4>","parent":0,"count":61,"image":null,"review_count":0,"permalink":"https:\/\/kcbrains.com\/product-category\/cannabis-seeds\/"},{"id":50,"name":"Feminized Seeds","slug":"feminized-seeds","description":"<h4><b>Feminized seeds<\/b> have undergone a process to produce only female plants. This means that every seed will produce a female cannabis plant, and it is the female plants that yield the marijuana flowers. Feminized seeds are a great choice for anyone who is after a single generation harvest. It is also a good choice for beginners in order to avoid the selection process.<\/h4>","parent":48,"count":34,"image":null,"review_count":0,"permalink":"https:\/\/kcbrains.com\/product-category\/cannabis-seeds\/feminized-seeds\/"},{"id":51,"name":"Regular Seeds","slug":"regular-seeds","description":"<h4><b>Regular Seeds<\/b> contain both male and female seeds, which allows for second and third generations of seeds, and is therefore a great choice for growers with a larger garden. Regular seeds usually contain 55% to 65% of female seeds. In order to make sinsemilla marijuana, the male and female plants need to be separated before flowering time. This requires knowledge of how to recognize the genders in order to separate them. The plant&#8217;s gender can be determined at the beginning of the flowering stage.<\/h4>","parent":48,"count":26,"image":null,"review_count":0,"permalink":"https:\/\/kcbrains.com\/product-category\/cannabis-seeds\/regular-seeds\/"}]
